docs/countingsort.html
<!doctype html>
<html lang="en">
<head>
<title>Algoritmo di ordinamento Counting Sort</title>
<!-- 2022-05-16 Mon 11:36 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<meta name="generator" content="Org-mode">
<meta name="author" content="Pietro Visconti">

<link  href="https://cdnjs.cloudflare.com/ajax/libs/twitter-bootstrap/3.3.5/css/bootstrap.min.css" rel="stylesheet">
</head>
<body>
<div id="content" class="container">
<div class="row"><div class="col-md-3 col-md-push-9"><nav id="table-of-contents">
<div id="text-table-of-contents" class="bs-docs-sidebar">
<ul class="nav">
<li><a href="#sec-1">1. Specifiche preliminari</a></li>
<li><a href="#sec-2">2. Algoritmo</a></li>
<li><a href="#sec-3">3. Complessità</a></li>
</ul>
</div>
</nav>
</div><div class="col-md-9 col-md-pull-3"><h1 class="title">Algoritmo di ordinamento Counting Sort</h1>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Specifiche preliminari</h2>
<div class="outline-text-2" id="text-1">
<blockquote>
<p>
Assunzione: i numeri da ordinare dono interi e compresi in un <b>intervallo che va da 0 a k</b>.
</p>

<p>
<b>INPUT</b>: A[1, 2, &#x2026;, n] dove A[j] ∈ [0 &#x2026; k] per ogni j ∈ {1 &#x2026; n}.
</p>

<p>
<b>OUTPUT</b>: B[1 &#x2026; n] ordinato.
</p>

<p>
Memoria ausiliaria: C[0 &#x2026; k] vettore delle occorrenze.
</p>
</blockquote>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Algoritmo</h2>
<div class="outline-text-2" id="text-2">
<div class="org-src-container">

<pre class="src src-cpp"><span style="color: #a89984;">/*</span>
<span style="color: #a89984;">A = array da ordinare</span>
<span style="color: #a89984;">B = array ordinato (alla fine dell'algoritmo)</span>
<span style="color: #a89984;">n = numero di elementi da ordinare</span>
<span style="color: #a89984;">k = intervallo entro il quale sono presenti i numeri da ordinare (da 0 a k)</span>
<span style="color: #a89984;">*/</span>
<span style="color: #b57614;">COUNTING_SORT</span><span style="color: #076678;">(</span><span style="color: #8f3f71;">vector</span><span style="color: #b16286;">&lt;</span><span style="color: #8f3f71;">int</span><span style="color: #b16286;">&gt;</span> <span style="color: #076678;">A</span>, <span style="color: #8f3f71;">vector</span><span style="color: #b16286;">&lt;</span><span style="color: #8f3f71;">int</span><span style="color: #b16286;">&gt;</span> <span style="color: #076678;">B</span>, <span style="color: #8f3f71;">int</span> <span style="color: #076678;">n</span>, <span style="color: #8f3f71;">int</span> <span style="color: #076678;">k</span><span style="color: #076678;">){</span>
    <span style="color: #8f3f71;">vector</span><span style="color: #b16286;">&lt;</span><span style="color: #8f3f71;">int</span><span style="color: #b16286;">&gt;</span> <span style="color: #076678;">C</span>;

    <span style="color: #a89984;">//</span><span style="color: #a89984;">Inizializzazione vettore delle occorrenze</span>
    <span style="color: #9d0006;">for</span><span style="color: #b16286;">(</span><span style="color: #8f3f71;">int</span> <span style="color: #076678;">i</span> = <span style="color: #8f3f71; font-weight: bold;">0</span>; i &lt;= k; i++<span style="color: #b16286;">){</span>
        C.push_back<span style="color: #8ec07c;">(</span><span style="color: #8f3f71; font-weight: bold;">0</span><span style="color: #8ec07c;">)</span>;
    <span style="color: #b16286;">}</span>

    <span style="color: #9d0006;">for</span><span style="color: #b16286;">(</span><span style="color: #8f3f71;">int</span> <span style="color: #076678;">j</span> = <span style="color: #8f3f71; font-weight: bold;">1</span>; j &lt; n; j++<span style="color: #b16286;">){</span>
        C.at<span style="color: #8ec07c;">(</span>A.at<span style="color: #d65d0e;">(</span>j<span style="color: #d65d0e;">)</span><span style="color: #8ec07c;">)</span>++;
    <span style="color: #b16286;">}</span>

    <span style="color: #a89984;">//</span><span style="color: #a89984;">somma dell'elemento selezionato con quello precedente (somme prefisse)</span>
    <span style="color: #9d0006;">for</span><span style="color: #b16286;">(</span><span style="color: #8f3f71;">int</span> <span style="color: #076678;">i</span> = <span style="color: #8f3f71; font-weight: bold;">1</span>; i &lt;= k; i++<span style="color: #b16286;">){</span>
        C.at<span style="color: #8ec07c;">(</span>i<span style="color: #8ec07c;">)</span> += C.at<span style="color: #8ec07c;">(</span>i - <span style="color: #8f3f71; font-weight: bold;">1</span><span style="color: #8ec07c;">)</span>;
    <span style="color: #b16286;">}</span>

    <span style="color: #9d0006;">for</span><span style="color: #b16286;">(</span><span style="color: #8f3f71;">int</span> <span style="color: #076678;">j</span> = n - <span style="color: #8f3f71; font-weight: bold;">1</span>; j &gt;= <span style="color: #8f3f71; font-weight: bold;">1</span>; j--<span style="color: #b16286;">){</span>
        B.at<span style="color: #8ec07c;">(</span>C.at<span style="color: #d65d0e;">(</span>A.at<span style="color: #076678;">(</span>j<span style="color: #076678;">)</span><span style="color: #d65d0e;">)</span><span style="color: #8ec07c;">)</span> = A.at<span style="color: #8ec07c;">(</span>j<span style="color: #8ec07c;">)</span>;
        C.at<span style="color: #8ec07c;">(</span>A.at<span style="color: #d65d0e;">(</span>j<span style="color: #d65d0e;">)</span><span style="color: #8ec07c;">)</span>--;
    <span style="color: #b16286;">}</span>
<span style="color: #076678;">}</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Complessità</h2>
<div class="outline-text-2" id="text-3">
<blockquote>
<p>
L&rsquo;algoritmo è <b>stabile</b> &#x2013;&gt; i numeri con lo stesso valore sono salvati con lo stesso ordine
</p>

<p>
Complessità: <font color="red"> θ(n + k)</font>
</p>

<p>
L&rsquo;algoritmo viene utilizzato quando k è dell&rsquo;ordine di n. In questo modo la complessità diventa <font color="red"> θ(n)</font>
</p>
</blockquote>

<p>
<a href="../index.html">HOME</a>
</p>
</div>
</div>
</div></div></div>
<footer id="postamble" class="">
<div><p class="author">Author: Pietro Visconti</p>
<p class="date">Created: 2022-05-16 Mon 11:36</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 28.0.91 (<a href="http://orgmode.org">Org-mode</a> 9.6)</p>
</div>
</footer>
</body>
</html>
